{"traits": [{"name": "Archers", "description": "This unit can attack any opposed unit. Successful Power tests the unit makes against opposed units that are not exposed inflict only 1 casualty.", "homebrew": false}, {"name": "Aaauuugh!!!", "description": "When this unit breaks, all adjacent units suffer 1 casualty.", "homebrew": false, "created": "2023-03-22 17:16:10.490986"}, {"name": "Adaptable", "description": "This unit has advantage on Moraleand Command tests.", "homebrew": false, "created": "2023-03-22 17:16:10.490986"}, {"name": "Aerial Bombardment", "description": "If this unit spends anactivation doing nothing, it can use its next activation to target a fortification by making a DC 13Power test. On a success, it deals 1d4 + 2 damage tothe fortification.", "homebrew": false, "created": "2023-03-22 17:16:10.490986"}, {"name": "Amphibious", "description": "This unit does not suffer movement penalties when fighting underwater, or in rain or mud.", "homebrew": false, "created": "2023-03-22 17:16:10.490986"}, {"name": "Arcadian", "description": "This unit has advantage on Powertests to resist battle magic.", "homebrew": false, "created": "2023-03-22 17:16:10.490986"}, {"name": "Archers", "description": "This unit can attack any opposed unit. Successful Power tests the unit makes againstopposed units that are not exposed inflict only1 casualty.Armored Carapace. This unit suffers no casualties from artillery Attack tests.", "homebrew": false, "created": "2023-03-22 17:16:10.490986"}, {"name": "Barbs", "description": "An opposed infantry unit that makes asuccessful Power test as part of an attack against this unit suffers 1 casualty.", "homebrew": false, "created": "2023-03-22 17:16:10.490986"}, {"name": "Battle Hymn", "description": "This unit has a bonus to Morale equal to its commander's domain size, as do allied units while adjacent to this unit.", "homebrew": false, "created": "2023-03-22 17:16:10.490986"}, {"name": "Better Than One", "description": "When this unit attacks an opposed unit, it can also attack any other adjacent opposed unit.", "homebrew": false, "created": "2023-03-22 17:16:10.490986"}, {"name": "Big", "description": "This unit has advantage on Power tests against units whose casualties are lower thanthis unit's.", "homebrew": false, "created": "2023-03-22 17:16:10.490986"}, {"name": "Blanket Fire", "description": "As an action, choose a rank on the battlefield. Attack each unit in that rank. Recharge 4–6.", "homebrew": false, "created": "2023-03-22 17:16:10.490986"}, {"name": "Blinding", "description": "When an opposed unit fails an Attack test against this unit, the opposed unit is disoriented.", "homebrew": false, "created": "2023-03-22 17:16:10.490986"}, {"name": "Burning", "description": "Each opposed unit that activates adjacent to this unit suffers 1 casualty.", "homebrew": false, "created": "2023-03-22 17:16:10.490986"}, {"name": "Burrow", "description": "As an action, remove this unit from the battlefield. On its next activation, place the unit in any empty space. The unit is disoriented until the end of that activation.", "homebrew": false, "created": "2023-03-22 17:16:10.490986"}, {"name": "Chaos Vulnerability", "description": "This unit has disadvantage on Power tests to resist battle magic.", "homebrew": false, "created": "2023-03-22 17:16:10.490986"}, {"name": "Charge", "description": "If this unit moves at least 1 space before it attacks, it has advantage on Attack tests for this activation as long as the target is in the direction the unit moved.", "homebrew": false, "created": "2023-03-22 17:16:10.490986"}, {"name": "Chorus Of Victory", "description": "As an action, choose a rank on the battlefield. Each allied unit in that rank increments its casualty die and has advantage on Attack tests until the end of its next activation. Recharge 6.", "homebrew": false, "created": "2023-03-22 17:16:10.490986"}, {"name": "Close Range", "description": "This unit has advantage on Attack tests and Power tests against adjacent units.", "homebrew": false, "created": "2023-03-22 17:16:10.490986"}, {"name": "Cloud Of Darkness", "description": "Opposed units have disadvantage on Attack tests against this unit.", "homebrew": false, "created": "2023-03-22 17:16:10.490986"}, {"name": "Collateral Damage", "description": "When this unit makes a successful Power test against an infantry or artillery unit, the unit opposite the target also suffers 1 casualty.", "homebrew": false, "created": "2023-03-22 17:16:10.490986"}, {"name": "Consume.", "description": "As an action, this unit targets an opposed unit with lower casualties than it that it can attack. The target must succeed on a DC 15 Power test or break. Recharge 5–6.", "homebrew": false, "created": "2023-03-22 17:16:10.490986"}, {"name": "Corrode", "description": "When this unit makes a successful Attack test against an opposed unit, that unit takes -2 to Attack and Defense. Each opposed unit canbe affected by this trait only once per battle.", "homebrew": false, "created": "2023-03-22 17:16:10.490986"}, {"name": "Corrosive Breath", "description": "As an action, choose three adjacent opposed units. Each unit must succeed ona Power test (DC = 8 + this unit's size) or suffer 2 casualties and gain one acid token. The acid token inflicts 1 casualty. Recharge 5–6.", "homebrew": false, "created": "2023-03-22 17:16:10.490986"}, {"name": "Create Dead", "description": "If this unit causes an opposed unitto break, replace that unit with a Ghoul Infantry unit under the command of this unit's commander. The new unit can act on the commander's next turn.", "homebrew": false, "created": "2023-03-22 17:16:10.490986"}, {"name": "Damage Resistant", "description": "Successful Attack tests against this unit inflict no casualties. Successful Power tests inflict casualties normally.", "homebrew": false, "created": "2023-03-22 17:16:10.490986"}, {"name": "Daylight Weakness", "description": "While in direct sunlight,this unit has disadvantage on Power tests.", "homebrew": false, "created": "2023-03-22 17:16:10.490986"}, {"name": "Dead", "description": "This unit always succeeds on Morale tests, and cannot be diminished.", "homebrew": false, "created": "2023-03-22 17:16:10.490986"}, {"name": "“Dig!”", "description": "As an action, choose a space containing an opposed fortification and remove this unit from the battlefield. On the unit's next activation, the target fortification takes 2d6 damage and this unit breaks as though it were in that space.", "homebrew": false, "created": "2023-03-22 17:16:10.490986"}, {"name": "Dire Hyena Mounts", "description": "This unit has advantage on Attack tests against diminished units.", "homebrew": false, "created": "2023-03-22 17:16:10.490986"}, {"name": "Disruptive", "description": "When an opposed unit adjacent to this unit activates, it has a 25 percent chance of doing nothing on that activation.", "homebrew": false, "created": "2023-03-22 17:16:10.490986"}, {"name": "Draconic Ancestry", "description": "This unit cannot be disorganized or weakened, and it is immune to the Harrowing trait.", "homebrew": false, "created": "2023-03-22 17:16:10.490986"}, {"name": "Dragonkin", "description": "If there is an allied dragon in the battle or if this unit's commander has some sortof draconic ancestry, this unit has advantage on Attack tests, Command tests, and Morale tests.", "homebrew": false, "created": "2023-03-22 17:16:10.490986"}, {"name": "Drone", "description": "As an action, choose a rank on the battlefield. Each opposed unit in that rank must succeedon a DC 15 Power test or suffer 1 casualty and be unable to move on its next activation. This unit canuse this trait only once per battle.", "homebrew": false, "created": "2023-03-22 17:16:10.490986"}, {"name": "Elfshot", "description": "When this unit succeeds on a Power test as part of an attack, the target unit must succeed on a DC 10 Power test or become weakened until the end of its next activation", "homebrew": false, "created": "2023-03-22 17:16:10.490986"}, {"name": "Embiggen", "description": "As a reaction to activating, this unit's size increases to 8. Its casualty die becomes a d8 and is incremented twice. Until the end of its activation, the unit has advantage on Attack tests and Power tests. This unit can use this trait only once per battle.", "homebrew": false, "created": "2023-03-22 17:16:10.490986"}, {"name": "Eternal", "description": "This unit has advantage on Morale tests against undead or fiend units, and on the Morale test to attack units with the Harrowing trait.", "homebrew": false, "created": "2023-03-22 17:16:10.490986"}, {"name": "Ethereal", "description": "This unit has +1 to movement. It can move through other units, but only if it can end its movement in an empty space. Other units do not gain bonuses to Defense from fortifications against this unit's attacks.", "homebrew": false, "created": "2023-03-22 17:16:10.490986"}, {"name": "Fade", "description": "After a successful Attack test, this unit canmove back 1 space. Opposed units cannot use the Follow Up maneuver in response.", "homebrew": false, "created": "2023-03-22 17:16:10.490986"}, {"name": "Fast Siege Weapon", "description": "This unit can attack a fortification. It automatically hits (no Attack test or Power test needed) and deals 3 damage.", "homebrew": false, "created": "2023-03-22 17:16:10.490986"}, {"name": "Fast Siege Weapon (Heavy).", "description": "This unit can attack a fortification. It automatically hits (no Attack test or Power test needed) and deals 5 damage.", "homebrew": false, "created": "2023-03-22 17:16:10.490986"}, {"name": "Fearless", "description": "This unit automatically succeeds on Morale tests.", "homebrew": false, "created": "2023-03-22 17:16:10.490986"}, {"name": "Fearsome", "description": "As a reaction to making an Attack test, this unit forces the target to succeed on aMorale test (DC = 8 + this unit's size) or suffer 1 additional casualty.", "homebrew": false, "created": "2023-03-22 17:16:10.490986"}, {"name": "Feast", "description": "At the end of this unit's activation, if any diminished unit is adjacent to it, increment this unit's casualty die.", "homebrew": false, "created": "2023-03-22 17:16:10.490986"}, {"name": "Fire Blast", "description": "As an action, this unit forces two adjacent opposed units to each make a DC 13 Power test. On a failure, a unit suffers 2 casualties. Recharge 5–6.", "homebrew": false, "created": "2023-03-22 17:16:10.490986"}, {"name": "Fire Breath", "description": "As an action, this unit forces three adjacent opposed units to each make a Power test(DC = 8 + this unit's size). On a failure, a unit suffers 2 casualties and gains a fire token. The fire token inflicts 1 casualty. Recharge 5–6.", "homebrew": false, "created": "2023-03-22 17:16:10.490986"}, {"name": "Fire Immunity", "description": "This unit does not suffer casualties from traits or other effects with “burning,” “fire,” or “flame” in their names, or from fire tokens.", "homebrew": false, "created": "2023-03-22 17:16:10.490986"}, {"name": "Flaming Weapons", "description": "When this unit makes a successful Power test as part of an attack, it adds a fire token to the target in addition to the normal effects of the test. The fire token inflicts 1 casualty.", "homebrew": false, "created": "2023-03-22 17:16:10.490986"}, {"name": "“Follow The Standard!”", "description": "When this unit succeeds on a Power test as part of an attack, each cavalry unit the unit's commander controls can usea reaction to immediately make an attack against the target of the Power test.", "homebrew": false, "created": "2023-03-22 17:16:10.490986"}, {"name": "Guerrillas", "description": "When this unit succeeds on an Attack test against any opposed infantry or artillery unit (but not siege weapons), that unit is disoriented.", "homebrew": false, "created": "2023-03-22 17:16:10.490986"}, {"name": "Gulp", "description": "As an action, this unit forces an opposed infantry or artillery unit (but not a siege engine) to make a DC 15 Power test. On a failure, the target unit is diminished (or is broken if it was already diminished). Recharge 5–6.", "homebrew": false, "created": "2023-03-22 17:16:10.490986"}, {"name": "Hallucinatory Spores", "description": "As an action, this unit forces a legal target to make a DC 15 Power test. On a failure, the opposed unit attacks one of its own allied units of this unit's choice on the opposed unit's next activation.", "homebrew": false, "created": "2023-03-22 17:16:10.490986"}, {"name": "Hard Hats", "description": "This unit has +2 to Defense against attacks from aerial units.", "homebrew": false, "created": "2023-03-22 17:16:10.490986"}, {"name": "Harriers", "description": "If this unit succeeds on a Power test aspart of an attack, this unit becomes the target unit's only legal target on its next activation.", "homebrew": false, "created": "2023-03-22 17:16:10.490986"}, {"name": "Harrowing", "description": "Any opposed infantry, cavalry, oraerial unit must first succeed on a Morale test (DC= 10 + this unit's tier) when it attacks this unit. On a success, the attacking unit is not affected by any unit's Harrowing trait for the rest of the battle. Ona failure, the attacking unit's activation ends.", "homebrew": false, "created": "2023-03-22 17:16:10.490986"}, {"name": "Heroes Of The Myriad Worlds", "description": "Once per battle as a bonus action, this unit can gain advantage on Attack tests and Power tests until the end of its activation.", "homebrew": false, "created": "2023-03-22 17:16:10.490986"}, {"name": "Holy", "description": "Undead and fiend units have disadvantage on Attack tests and Power tests against this unit.", "homebrew": false, "created": "2023-03-22 17:16:10.490986"}, {"name": "Hop", "description": "For its movement, this unit can move to any empty space on the battlefield.", "homebrew": false, "created": "2023-03-22 17:16:10.490986"}, {"name": "Implacable", "description": "This unit cannot unwillingly be moved or teleported, and it can ignore any effectsof terrain.", "homebrew": false, "created": "2023-03-22 17:16:10.490986"}, {"name": "Indistinct", "description": "Attack tests for ranged attacks made against this unit have disadvantage.", "homebrew": false, "created": "2023-03-22 17:16:10.490986"}, {"name": "Inexorable", "description": "This unit is immune to any effect that would hinder or stop its movement, or that would deny it the ability to use actions.", "homebrew": false, "created": "2023-03-22 17:16:10.490986"}, {"name": "Inspire Fear", "description": "Whenever this unit leaves an opposed unit diminished, all goblinoid units in the same rank as this unit can immediately attack alegal target.", "homebrew": false, "created": "2023-03-22 17:16:10.490986"}, {"name": "Into The Breach", "description": "When this unit successfully executes the Follow Up maneuver, it has +2 bonusto Defense until the beginning of its next activation.", "homebrew": false, "created": "2023-03-22 17:16:10.490986"}, {"name": "Invisibility", "description": "This unit cannot be attacked until itsuccessfully attacks an opposed unit", "homebrew": false, "created": "2023-03-22 17:16:10.490986"}, {"name": "Jaunt", "description": "In place of its movement, remove this unit from the battlefield. It returns to the space it left, or an unoccupied space of the GM's choice if that space is occupied, at the start of its next activation. Recharge 5–6.", "homebrew": false, "created": "2023-03-22 17:16:10.490986"}, {"name": "Lightning Breath", "description": "As an action, choose a rank on the battlefield. Each unit in that rank must succeed on a Power test (DC = 8 + this unit's size) or suffer 2 casualties. Recharge 5–6.", "homebrew": false, "created": "2023-03-22 17:16:10.490986"}, {"name": "Load The Bones!", "description": "While any diminished unitis adjacent to this unit, this unit has +2 damage against opposed fortifications.Magic Resistant. This unit has advantage onPower tests to resist battle magic.", "homebrew": false, "created": "2023-03-22 17:16:10.490986"}, {"name": "Magical Adepts", "description": "As a bonus action, this unitforces an opposed unit to make a DC 13 PowerTest. On a failure, allied units have advantage onAttack tests against the opposed unit until the endof the battle. Recharge 5–6.", "homebrew": false, "created": "2023-03-22 17:16:10.490986"}, {"name": "Maneuver: Detonate", "description": "As an action, this unitdeals 1d4 + 2 damage to an adjacent fortification.Recharge 3–6.Maneuver: “Evasive Maneuvers!” As areaction when an opposed artillery unit makes an Attack test against this unit, impose disadvantage onthe opposed unit's Attack test. Recharge 5–6.", "homebrew": false, "created": "2023-03-22 17:16:10.490986"}, {"name": "Maneuver: “Fire!!”", "description": "As a reaction to a successful Power test made against a target unit, add a fire token to the target. The fire token inflicts 1 casualty.Recharge 4–6.", "homebrew": false, "created": "2023-03-22 17:16:10.490986"}, {"name": "Maneuver: “Hold The Line!”", "description": "As a reaction to being diminished, this unit makes a DC 13Command test. On a success, this unit ignores the casualties that caused it to become diminished, andis not diminished.", "homebrew": false, "created": "2023-03-22 17:16:10.490986"}, {"name": "Maneuver: “Lancers! Flank Them!”", "description": "As are action when an opposed cavalry or aerial unit inflicts 1 or more casualties on an allied infantry or artillery unit, this unit makes a free attack against that opposed unit.", "homebrew": false, "created": "2023-03-22 17:16:10.490986"}, {"name": "Maneuver: “Land And Charge!”", "description": "While this unit has the aerial type, it can use a bonus action to make a DC 11 Command test. On a success, this unit's Power tests have +2 damage on this activation, but the unit's type becomes cavalry. At the end of its next activation, the unit regains the aerial type. Recharge 4–6.", "homebrew": false, "created": "2023-03-22 17:16:10.490986"}, {"name": "Maneuver: Outflank", "description": "As an action, move this unit into any empty space. Any opposed unit that executes the Follow Up maneuver in response has disadvantage on the Command test.", "homebrew": false, "created": "2023-03-22 17:16:10.490986"}, {"name": "Maneuver: “Prey On The Weak.”", "description": "As a reaction to an exposed opposed unit being diminished, this unit makes a DC 10 Command test. On a success, the unit makes an attack against the opposed unit.", "homebrew": false, "created": "2023-03-22 17:16:10.490986"}, {"name": "Maneuver: Repair", "description": "As an action, a fortification this unit is on or adjacent to recovers 1d4 + 2 hitpoints, up to its starting hit points.", "homebrew": false, "created": "2023-03-22 17:16:10.490986"}, {"name": "Maneuver: “Spit Upon Their Horns.”", "description": "As areaction to succeeding on a Power test made as part of an attack, this unit makes a DC 13 Commandtest. On a success, the target unit suffers 1 additional casualty.", "homebrew": false, "created": "2023-03-22 17:16:10.490986"}, {"name": "Maneuver: Strafe", "description": "As a reaction to succeeding on a Power test made as part of an attack against an opposed artillery or infantry unit, this unit makes a DC 13 Command test. On a success, two adjacent opposed units in the same rank as the target unit each suffer 1 casualty.", "homebrew": false, "created": "2023-03-22 17:16:10.490986"}, {"name": "Maneuver: Testudo", "description": "As a reaction to suffering 1 or more casualties from an opposed artillery or aerial unit's Attack test, this unit makes a DC 13 Command test. On a success, any opposed unit targeting this unit has disadvantage on Power tests until this unit's next activation.", "homebrew": false, "created": "2023-03-22 17:16:10.490986"}, {"name": "Mass Protection Against Evil.", "description": "Any opposed infantry or artillery unit must succeed on a DC15 Morale test to enter the vanguard rank of this unit's side.", "homebrew": false, "created": "2023-03-22 17:16:10.490986"}, {"name": "Meld", "description": "As a reaction to a successful Attack test against an infantry or artillery unit, this unit can move into the target unit's space. While this unit is in the target's space, the target unit cannot move and can attack only this unit. Units attacking either unit in this space have a 50 percent chance of targeting the wrong unit.", "homebrew": false, "created": "2023-03-22 17:16:10.490986"}, {"name": "Mobile", "description": "This unit has advantage on the Command test when using the Follow Up maneuver, and can move back 2 spaces when using the With drawmaneuver.", "homebrew": false, "created": "2023-03-22 17:16:10.490986"}, {"name": "Nature'S Bond", "description": "When an allied infantry or artillery unit suffers 1 or more casualties, this unit can take the casualty instead. This unit must deploy in its side's front.", "homebrew": false, "created": "2023-03-22 17:16:10.490986"}, {"name": "None", "description": "This unit has no traits.", "homebrew": false, "created": "2023-03-22 17:16:10.490986"}, {"name": "Noxious Fog", "description": "As an action, this unit places two poison tokens in each of 4 adjacent spaces. Any unit that moves into a space with one or more of these poison tokens or that activates there suffers 1 casualty per token. Each space loses one poison token at the end of this unit's subsequent activations. Recharge 5–6.", "homebrew": false, "created": "2023-03-22 17:16:10.490986"}, {"name": "Pack Tactics", "description": "When an adjacent unit that also has this trait successfully uses the Follow Up maneuver, this unit can move into any empty space adjacent to this unit's current position.", "homebrew": false, "created": "2023-03-22 17:16:10.490986"}, {"name": "Pike Training", "description": "This unit automatically succeeds on Command test for the Set for Charge manuever.", "homebrew": false, "created": "2023-03-22 17:16:10.490986"}, {"name": "Point Blank", "description": "When this unit succeeds on a Power test as part of an attack against an adjacent unit, it inflicts 1 additional casualty", "homebrew": false, "created": "2023-03-22 17:16:10.490986"}, {"name": "Poisonous", "description": "When this unit succeeds on a Power test as part of an attack, the target unit is also weakened until the end of its next activation.", "homebrew": false, "created": "2023-03-22 17:16:10.490986"}, {"name": "Pool Of Soul'S Blood", "description": "Any opposed infantry or artillery unit adjacent to this unit cannot leave its space.", "homebrew": false, "created": "2023-03-22 17:16:10.490986"}, {"name": "Quadruped", "description": "For its movement, this unit becomes a cavalry unit until the end of its activation. The unit leaves the grid and then returns to the space it left at the end of its activation (or to its army's reserve rank if that space is occupied). Recharge 5–6.", "homebrew": false, "created": "2023-03-22 17:16:10.490986"}, {"name": "Ram Riders", "description": "When this unit succeeds on a Power test as part of an attack, the target unit must succeed on a followup DC 10 Power test or become disoriented until the end of its next activation.", "homebrew": false, "created": "2023-03-22 17:16:10.490986"}, {"name": "Reckless", "description": "This unit can take disadvantage on any Attack test in order to have that Attack test inflict an additional 1 casualty.", "homebrew": false, "created": "2023-03-22 17:16:10.490986"}, {"name": "Reflector", "description": "When this unit fails a Power test against a wand, it can use a reaction to roll a d20.On a 10 or higher, this unit suffers no effect from the wand and the unit activating the wand suffers the effect instead.", "homebrew": false, "created": "2023-03-22 17:16:10.490986"}, {"name": "Regenerate", "description": "Each time this unit activates, increment its casualty die by 1.", "homebrew": false, "created": "2023-03-22 17:16:10.490986"}, {"name": "Relentless", "description": "As a reaction to suffering a casualty that would cause this unit to break, this unit makes a DC 13 Power test. On a success, this unit does not break and has 1 casualty.", "homebrew": false, "created": "2023-03-22 17:16:10.490986"}, {"name": "Rime", "description": "Any opposed infantry or artillery unit adjacent to this unit has its movement reduced to 0 and cannot benefit from bonus movement.", "homebrew": false, "created": "2023-03-22 17:16:10.490986"}, {"name": "Rock!", "description": "As an action, this unit can make an Attack test against any opposed unit, with disadvantage if the target is an aerial unit. Recharge 4–6.", "homebrew": false, "created": "2023-03-22 17:16:10.490986"}, {"name": "Rockbreaker", "description": "This unit deals double damage against fortifications.", "homebrew": false, "created": "2023-03-22 17:16:10.490986"}, {"name": "Rolling Thunder", "description": "As an action, this unit makes an opposed Power test against an adjacent opposed unit. If this unit's result is equal to or greater than the target's, the target unit must move back 1 space or break. This unit immediately moves into the target unit's vacated space.", "homebrew": false, "created": "2023-03-22 17:16:10.490986"}, {"name": "Rush", "description": "This unit automatically succeeds on the Command test for the Follow Up maneuver.", "homebrew": false, "created": "2023-03-22 17:16:10.490986"}, {"name": "Savage", "description": "Each successful Attack test by this unit adds a bleed token to a target unit. Each bleed token inflicts 2 casualties. Scourge of the Wild. This unit has +2 to Attack and +2 to Power against orc, goblinoid, or elf units.", "homebrew": false, "created": "2023-03-22 17:16:10.490986"}, {"name": "Scouts", "description": "This unit can deploy into the rear rankof an opposed army", "homebrew": false, "created": "2023-03-22 17:16:10.490986"}, {"name": "Screech", "description": "As an action, this unit forces an opposed unit to succeed on a DC 15 Power test or become misled. Recharge 4–6.", "homebrew": false, "created": "2023-03-22 17:16:10.490986"}, {"name": "Shock Troops", "description": "Each time this unit causes another unit to be diminished, this unit gains +2 to Attack and +2 to Power until the end of the battle.", "homebrew": false, "created": "2023-03-22 17:16:10.490986"}, {"name": "Siege Engine", "description": "This unit must spend 1 round of battle doing nothing before each attack. This unit can attack a fortification. It automatically hits (no Attack test or Power test needed) and deals 1d4+ 2 damage.", "homebrew": false, "created": "2023-03-22 17:16:10.490986"}, {"name": "Siege Weapon", "description": "This unit can attack an adjacent fortification. It automatically hits (no Attack test or Power test needed) and deals 3 damage.", "homebrew": false, "created": "2023-03-22 17:16:10.490986"}, {"name": "Slam", "description": "When this unit succeeds on a Power test aspart of an attack, the target unit is also disoriented.", "homebrew": false, "created": "2023-03-22 17:16:10.490986"}, {"name": "Smoke Screen.", "description": "When this unit succeeds on an Attack test against another unit, that unit is also disoriented.", "homebrew": false, "created": "2023-03-22 17:16:10.490986"}, {"name": "Solar Flare", "description": "Once per battle as a reaction totargeting a fortification, the damage this unit deals to fortifications is maximized, and it deals that damage to all fortifications in one rank.", "homebrew": false, "created": "2023-03-22 17:16:10.490986"}, {"name": "Soporific Spores", "description": "As an action, this unit forces a legal target to make a DC 13 Power test. On a failure, the opposed unit is disorganized.", "homebrew": false, "created": "2023-03-22 17:16:10.490986"}, {"name": "Sow Chaos", "description": "Each opposed unit within 1 space ofthis unit has disadvantage on Morale and Command tests, and suffers 1 additional casualty if itfails the Morale test to avoid becoming diminished.", "homebrew": false, "created": "2023-03-22 17:16:10.490986"}, {"name": "Spike Shot", "description": "As an action, this unit forces a target unit to succeed on a DC 12 Power test or suffer 2 casualties and become weakened. An affected unit can repeat this power test at the end of each of its activations to lose the weakened unit condition. Recharge 5–6.", "homebrew": false, "created": "2023-03-22 17:16:10.490986"}, {"name": "Split", "description": "When this unit is diminished, place an identical unit with the same current battle statistics and casualties in an empty adjacent space.", "homebrew": false, "created": "2023-03-22 17:16:10.490986"}, {"name": "Spores", "description": "When this unit is targeted by a successful Attack test from an infantry, cavalry, or aerial unit,the attacking unit must succeed on a DC 13 Powertest or become disoriented.", "homebrew": false, "created": "2023-03-22 17:16:10.490986"}, {"name": "Stalwart", "description": "While this unit is diminished, opposed infantry and cavalry units have disadvantage on Power tests against it.", "homebrew": false, "created": "2023-03-22 17:16:10.490986"}, {"name": "Stinky", "description": "Any opposed unit adjacent to this unit has disadvantage on Attack tests.", "homebrew": false, "created": "2023-03-22 17:16:10.490986"}, {"name": "Stone", "description": "Each opposed unit that activates adjacent to this unit suffers 1 casualty", "homebrew": false, "created": "2023-03-22 17:16:10.490986"}, {"name": "Stoneskin", "description": "As a reaction to suffering 1 or more casualties from any opposed artillery unit, this unit can ignore 1 of those casualties.", "homebrew": false, "created": "2023-03-22 17:16:10.490986"}, {"name": "Stoneskin", "description": "As a reaction to suffering 1 or more casualties from any opposed artillery unit, this unit can ignore 1 of those casualties.", "homebrew": false, "created": "2023-03-22 17:16:10.490986"}, {"name": "Strength In Numbers", "description": "This unit begins the battle with 1 additional casualty for each other undead unit in its army (up to a maximum of 12 casualties).", "homebrew": false, "created": "2023-03-22 17:16:10.490986"}, {"name": "Stupid", "description": "Each time it attacks, this unit has a 25 percent chance of ignoring its intended target and attacking a random adjacent unit.", "homebrew": false, "created": "2023-03-22 17:16:10.490986"}, {"name": "Swords Of The Dragon Lord", "description": "When this unitmakes a successful Attack test against a target unit, the target must succeed on a DC 13 Morale test orsuffer 1 additional casualty.", "homebrew": false, "created": "2023-03-22 17:16:10.490986"}, {"name": "To The Death", "description": "If this unit breaks as a result of an opposed infantry, cavalry, or aerial unit's Attack or Power test, the attacking unit suffers 1 casualty.", "homebrew": false, "created": "2023-03-22 17:16:10.490986"}, {"name": "Veterans Of A Thousand Wars.", "description": "This unit's movement increases by 1. When attacking units of a lower tier, its damage increases by 1.", "homebrew": false, "created": "2023-03-22 17:16:10.490986"}, {"name": "Wail", "description": "Once per battle, this unit can use an action to force each adjacent opposed unit to make a DC15 Power test. On a failure, a unit suffers 1 casualty, and its Morale bonus is reduced to 0 until the end of its next activation. On a success, a unit has disadvantage on Morale tests until the end of its next activation.", "homebrew": false, "created": "2023-03-22 17:16:10.490986"}, {"name": "Warbred", "description": "As a reaction to succeeding on a Power test as part of an attack, this unit can make a DC 10 Command test. On a success, this unit can Attack again.", "homebrew": false, "created": "2023-03-22 17:16:10.490986"}, {"name": "Wave", "description": "When this unit succeeds on a Power test as part of an attack against an opposed unit, the opposed unit is pushed back 1 space if there is an empty space behind it. If there is no empty space,the opposed unit and the unit behind it each suffer 1 casualty.", "homebrew": false, "created": "2023-03-22 17:16:10.490986"}, {"name": "Whirlwind", "description": "When this unit succeeds on an Attack test against an opposed infantry unit, that unit takes −2 to Attack and Defense. Each opposed unit can be affected by this trait once per battle.", "homebrew": false, "created": "2023-03-22 17:16:10.490986"}, {"name": "You Follow!", "description": "Whenever this unit successfully usesthe Follow Up maneuver, each goblinoid unit in the rank this unit leaves can move 1 space.", "homebrew": false, "created": "2023-03-22 17:16:10.490986"}, {"name": "Armor Osmosis", "description": "When a heavy or Super-Heavy unit adjacent to this unit breaks, increment this unit's casualty die.", "homebrew": false, "created": "2023-03-22 17:21:07.858427"}, {"name": "Beacon Of Courage", "description": "This unit and any adjacent allied unis automatically succeed on the Morale test to attack units with the Harrowing Trait.\u001b[D\u001b[D\u001b[D\u001b[D\u001b[D\u001b[D\u001b[D\u001b[D\u001b[D\u001b[D\u001b[D\u001b[D\u001b[D\u001b[D\u001b[D\u001b[D\u001b[D\u001b[D\u001b[D\u001b[D\u001b[D\u001b[D\u001b[D\u001b[D\u001b[D\u001b[D\u001b[D\u001b[D\u001b[D\u001b[D\u001b[D\u001b[D\u001b[D\u001b[D\u001b[D\u001b[D\u001b[D\u001b[D\u001b[D\u001b[D\u001b[D\u001b[D\u001b[D\u001b[D\u001b[D\u001b[D\u001b[D\u001b[D\u001b[D\u001b[D\u001b[D\u001b[D\u001b[D\u001b[D\u001b[D\u001b[D\u001b[D\u001b[D\u001b[D\u001b[D\u001b[D\u001b[D\u001b[D\u001b[D\u001b[D\u001b[D\u001b[D\u001b[D\u001b[D\u001b[D\u001b[D\u001b[D\u001b[D\u001b[D\u001b[D\u001b[D\u001b[D\u001b[D\u001b[D\u001b[D\u001b[D\u001b[D\u001b[D\u001b[Dt\u001b[C\u001b[C\u001b[C\u001b[C\u001b[C\u001b[C\u001b[C\u001b[C\u001b[C\u001b[C\u001b[C\u001b[C\u001b[C\u001b[C\u001b[C\u001b[C\u001b[C\u001b[C\u001b[C\u001b[C\u001b[C\u001b[C\u001b[C\u001b[C\u001b[C\u001b[C\u001b[C\u001b[C\u001b[C\u001b[C\u001b[C\u001b[C\u001b[C\u001b[C\u001b[C\u001b[C\u001b[C\u001b[C\u001b[C\u001b[C\u001b[C\u001b[C\u001b[C\u001b[C\u001b[C\u001b[C\u001b[C\u001b[C\u001b[C\u001b[C\u001b[C\u001b[C\u001b[C\u001b[C\u001b[C\u001b[C\u001b[C\u001b[C\u001b[C\u001b[C\u001b[C\u001b[C\u001b[C\u001b[C\u001b[C\u001b[C\u001b[C\u001b[C\u001b[C\u001b[C\u001b[C\u001b[C\u001b[C\u001b[C\u001b[C\u001b[C\u001b[C\u001b[C\u001b[C\u001b[C\u001b[C\u001b[C\u001b[C", "homebrew": false, "created": "2023-03-22 17:21:59.915189"}, {"name": "Beacon Of Order", "description": "Adjacent allied units can use this unit's Power bonus on tests to resist the effects of battle magic and can use this unit's Morale bonus on tests to avoid suffering a casualty when affected by battle magic.", "homebrew": false, "created": "2023-03-22 17:22:57.074953"}, {"name": "Bless The Rains", "description": "Once per battle, as an action, this unit turns the battlefield's terrain to rain. The terrain remains rain until the end of the battle or until another unit's trait or battle magic changes the terrain.", "homebrew": false, "created": "2023-03-22 17:23:44.129904"}, {"name": "Close Enough", "description": "This unit counts as a dragon for the purpose of other unit's Dragonkin trait.", "homebrew": false, "created": "2023-03-22 17:24:26.058097"}, {"name": "Cunning Ambush", "description": "When this unit succeeds on a Power test as part of an attack, it can choose to make the target suffer an extra casualty and this unit becomes hidden until the start of its next activation. Recharge 4-6.", "homebrew": false, "created": "2023-03-22 17:25:13.986483"}, {"name": "Defy Gravity", "description": "As an action, this unit can choose one unit adjacent to it. That unit's type becomes aerial until the end of its next activation, and it is temporarily removed from teh battlefield. When that unit's type reverts to its original type, it chooses to be placed in one empty space on the battlefield. Recharge 6.", "homebrew": false, "created": "2023-03-22 17:27:05.434069"}, {"name": "Directed Fire", "description": "When this unit attacks a target that is not exposed, allied Tier I and Tier II artillery units that are not siege weapons can attack that target as a reaction.", "homebrew": false, "created": "2023-03-22 17:27:50.546091"}, {"name": "Expert Fade", "description": "After a successful Attack test, this unit can move 1 space. Opposed units cannot use the Follow Up maneuver in response.", "homebrew": false, "created": "2023-03-22 17:29:03.217226"}, {"name": "Find Path", "description": "When you deploy this unit, place two hidden path tokens, one on each side of the battlefield, wherever you choose. Any elf unit can move between spaces with hidden path tokens as if they were adjacent. Any unit that is not an elf unit takes 1 casualty if it ends its activation on a space with a hidden path token. If a rank with a hidden path token collapses, the token moves forward into the closest space that is not collapsed. The hidden path tokens remain on the battlefield until the end of the battle.", "homebrew": false, "created": "2023-03-22 17:31:30.793131"}, {"name": "First Strike", "description": "When deployment ends, this unit activates.", "homebrew": false, "created": "2023-03-22 17:31:46.450144"}, {"name": "Frame", "description": "When this unit is diminished, it has disadvantage on attacks and its Damage is reduced by 1.", "homebrew": false, "created": "2023-03-22 17:32:05.713156"}, {"name": "Fury", "description": "Whenever this unit suffers casualites, its Attack and Power increase by 1 for each casualty it suffers. This bonus lasts until the end of the battle. Additionally, while htis unit is diminished, its Damage increases by 1.", "homebrew": false, "created": "2023-03-22 17:33:02.833366"}, {"name": "Goblin Battle Platform", "description": "This unit cannot be rallied during a battle. When this unit breaks, place a unit of Goblin Smokers under your control on teh battlefield according to normal deployment rules. After the battle, the Goblin Smokers disband and you can make a Rally test for this unit.", "homebrew": false, "created": "2023-03-22 17:36:07.504926"}, {"name": "Harpoon", "description": "When this unit succeeds on a Power test made as part of an attack against a cavalry or aerial unit, the target unit is snared (see Snared Condition), and this unit's activation ends.", "homebrew": false, "created": "2023-03-22 17:36:53.472762"}, {"name": "Hellfire Cannons", "description": "As an action, this unit can force all opposed aerial units to make a DC 13 Command Test. On a failure, an opposed unit takes 2 casualties and has disadvantage on Attack tests until the end of its next turn. On a success, the opposed unit takes 1 casualty and doesn't suffer disadvantage on its next attack from this trait. Recharge 5-6.", "homebrew": false, "created": "2023-03-22 17:39:09.440598"}, {"name": "It Will Burn As We Burn", "description": "When this unit is affected by one or more fire tokens and succeeds on a Power Test from an attack, the target of the attack gains a fire token that inflicts 1 casualty.", "homebrew": false, "created": "2023-03-22 17:40:03.537342"}, {"name": "Lightning", "description": "When this unit succeeds on a Power test as part of an attack, the target unit must make a Power test (DC = 10 + this unit's tier). On a failure, the target is disorganized. On a success, the target unit is disoriented.", "homebrew": false, "created": "2023-03-22 17:41:37.368372"}, {"name": "Made From Magic", "description": "This unit has advantage on tests to use battle magic. Opposing units have disadvantage on tests to use battle magic targeting this unit.", "homebrew": false, "created": "2023-03-22 17:42:27.951960"}, {"name": "Maneuver: Break Them", "description": "As a reaction to this unit diminishing another unit, make a DC 16 command test\u001b[D\u001b[D\u001b[D\u001b[D\u001b[D\u001b[D\u001b[D\u001b[D\u001b[D\u001b[D\u001b[C\u001b[C\u001b[C\u001b[C\u001b[C\u001b[C\u001b[C\u001b[C\u001b[C\u001b[C\u001b[C\u001b[C\u001b[C\u001b[C\u001b[D\u001b[D\u001b[COn a success, the diminished unit is broken.", "homebrew": false, "created": "2023-03-22 17:43:35.391840"}, {"name": "Maneuver: Focused Aim", "description": "As a bonus action, this unit can increase its Damage by 1 until the end of its activation. To take this bonus action, the unit must not have moved this activation, and after taking this bonus action, it cannot move until the start of its next activation. Recharge 5-6.", "homebrew": false, "created": "2023-03-22 17:45:21.815166"}, {"name": "Maneuver: Scamp-Ede Of Corgis", "description": "As an action, this unit chooses one exposed unit, and chaotically frolics through its space. If the unit is an opposed unit, it becomes disorganized. If the unit is an allied unit, it automatically succeeds on Morale tests until the end of its next activation. Recharge 4-6.", "homebrew": false, "created": "2023-03-22 17:46:45.583961"}, {"name": "Master Elf-Shot", "description": "When this unit succeeds on a Power test as part of an attack, the target unit must succeed on a DC 15 Power test or become weakened until the end of its next activation.", "homebrew": false, "created": "2023-03-22 17:47:52.567575"}, {"name": "Max Burn!", "description": "As a reaction to activating this unit can suffer 1 casualty. If it does so, it gets one extra attack and has advantage on Power tests this activation.", "homebrew": false, "created": "2023-03-22 17:49:19.775339"}, {"name": "Mobile Battery", "description": "On this unit's activation, it can either take an action or move, but not both.", "homebrew": false, "created": "2023-03-22 17:50:14.047883"}, {"name": "Now This Is An Aaauuugh!!!", "description": "When this unit is diminished, each time it takes casualties from an attack, the attacking unit suffers 1 casualty.", "homebrew": false, "created": "2023-03-22 17:50:54.872188"}, {"name": "Offensive", "description": "As a reaction to this unit failing an Attack test, this unit can make a DC 13 Command test. On a success, this unit can attack again.", "homebrew": false, "created": "2023-03-22 17:51:40.927904"}, {"name": "Only The Smart Survive", "description": "This unit has advantage on tests to resist battle magic, and tests to make maneuvers against this unit have disadvantage.", "homebrew": false, "created": "2023-03-22 17:52:23.351731"}, {"name": "Owlbears Can'T Fly?!", "description": "While this unit has the cavalry type, it can use a bonus action to change its type to Aerial until the beginning of its next activation. Recharge 5-6.", "homebrew": false, "created": "2023-03-22 17:53:16.143283"}, {"name": "Plagued", "description": "When this unit makes a successful Power test as part of an attack, the target gains a poison token in addition to the normal effects of the test. Each poison token inflicts 1 casualty.", "homebrew": false, "created": "2023-03-22 17:54:44.791262"}, {"name": "Power Word: Annihilate", "description": "Once per battle as an action, this unit targets one diminished unit on teh battlefield. That unit breaks.", "homebrew": false, "created": "2023-03-22 17:55:26.255437"}, {"name": "Ride The Lightning", "description": "As an action, this unit can make a DC 13 Command test to target a unit with this trait. On a success, the target unit and each unit adjacent to it must succeed on a DC 15 Power test or suffer 1 casualty, or 2 casualties if the terrain is rain. Recharge 6.", "homebrew": false, "created": "2023-03-22 17:56:46.030921"}, {"name": "Shock And Awe", "description": "As an action, this unit chooses a space on the battlefield. Each unit in that space and every adjacent space must suceed \u001b[D\u001b[D\u001b[D\u001b[D\u001b[C\u001b[C\u001b[ceed on a DC 14 Power test or suffer 2 casualties and suffer disadvantage on Command and Morale checks until the end of its next turn. Recharge 4-6.", "homebrew": false, "created": "2023-03-22 17:58:47.535436"}, {"name": "Siege Weapon (Heavy)", "description": "This unit can attack an adjacent fortification. It automatically hits (no Attack test or Power test needed) and deals 5 damage.", "homebrew": false, "created": "2023-03-22 17:59:33.319330"}, {"name": "Strength Of The Wilds", "description": "While this unit is in a space with a hidden path token, it has advantage on Attack tests.", "homebrew": false, "created": "2023-03-22 17:59:58.215055"}, {"name": "Stygian Orb", "description": "As a reaction to an opposed unit breaking, the Rolling Graveyard can replace that unit with a Ghoul Infantry unit under the command of this unit's commander.", "homebrew": false, "created": "2023-03-22 18:01:03.095063"}, {"name": "Survival Of The Fittest", "description": "This unit cannot suffer more than 2 casualties during its or another unit's activation. When an opposing unit succeeds on an Attack test against this unit and this unit is diminished, make a DC 15 Command test. On a success, the opposing Attack test fails instead.", "homebrew": false, "created": "2023-03-22 18:03:01.198307"}, {"name": "Terror-Dactyls", "description": "As a reaction to making an Attack test, this unit forces the target to succeed on a Morale test (DC = 8 + this unit's size) or become disoriented.", "homebrew": false, "created": "2023-03-22 18:03:46.974744"}, {"name": "Wireless", "description": "This unit always succeeds on Command and Morale tests.", "homebrew": false, "created": "2023-03-22 18:04:02.941822"}, {"name": "You Will Be Upgraded", "description": "As a reaction to becoming broken, this unit can target an adjacent diminished unit and make a DC 15 Power test. On success, this unit breaks and can't be rallied unitl the end of battle, and this unit's commander gains control of the target unit. The target unit's defense becomes 16 and its toughness becomes 20.", "homebrew": false, "created": "2023-03-22 18:05:21.350370"}], "updated": "2023-03-22 18:05:23.710313"}